#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
google_compute_network.vpc: Refreshing state... [id=projects/dark-gateway-330714/global/networks/dark-gateway-330714-vpc]
google_sql_database.database_cicd: Refreshing state... [id=projects/dark-gateway-330714/instances/new-2-devfest-database-instance/databases/devfest_database_cicd]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/dark-gateway-330714/regions/us-central1/subnetworks/dark-gateway-330714-subnet]
google_sql_database_instance.instance: Refreshing state... [id=new-2-devfest-database-instance]
google_container_cluster.primary: Refreshing state... [id=projects/dark-gateway-330714/locations/us-central1/clusters/dark-gateway-330714-gke]
google_container_node_pool.primary_nodes: Refreshing state... [id=projects/dark-gateway-330714/locations/us-central1/clusters/dark-gateway-330714-gke/nodePools/dark-gateway-330714-gke-node-pool]
google_sql_user.users: Refreshing state... [id=root/%/new-2-devfest-database-instance]
google_sql_database.database: Refreshing state... [id=projects/dark-gateway-330714/instances/new-2-devfest-database-instance/databases/devfest_database]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_secret_manager_secret.database-password will be created
  + resource "google_secret_manager_secret" "database-password" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "database-password"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-central1"
                }
            }
        }
    }

  # google_secret_manager_secret.database-url will be created
  + resource "google_secret_manager_secret" "database-url" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "database-url"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-central1"
                }
            }
        }
    }

  # google_secret_manager_secret.database-username will be created
  + resource "google_secret_manager_secret" "database-username" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "database-username"

      + replication {
          + user_managed {
              + replicas {
                  + location = "us-central1"
                }
            }
        }
    }

  # google_secret_manager_secret_version.database-password will be created
  + resource "google_secret_manager_secret_version" "database-password" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.database-url will be created
  + resource "google_secret_manager_secret_version" "database-url" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_secret_manager_secret_version.database-username will be created
  + resource "google_secret_manager_secret_version" "database-username" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # google_sql_database.cicd will be created
  + resource "google_sql_database" "cicd" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "new-2-devfest-database-instance"
      + name      = "devfest_database_cicd"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

  # google_sql_database.database_cicd will be destroyed
  - resource "google_sql_database" "database_cicd" {
      - charset   = "utf8" -> null
      - collation = "utf8_general_ci" -> null
      - id        = "projects/dark-gateway-330714/instances/new-2-devfest-database-instance/databases/devfest_database_cicd" -> null
      - instance  = "new-2-devfest-database-instance" -> null
      - name      = "devfest_database_cicd" -> null
      - project   = "dark-gateway-330714" -> null
      - self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/dark-gateway-330714/instances/new-2-devfest-database-instance/databases/devfest_database_cicd" -> null
    }

  # google_sql_database.secret_manager will be created
  + resource "google_sql_database" "secret_manager" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "new-2-devfest-database-instance"
      + name      = "devfest_database_secret_manager"
      + project   = (known after apply)
      + self_link = (known after apply)
    }

Plan: 8 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @anthonydurot, Action: `pull_request`*